data_set_wrote_by_yingshaoxo = [
"""
假设一个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路”。
于是农民勤勤恳恳，每日劳作，每日学习。终于在20年后达到了一个比较自由的状态。种什么，什么大丰收。可以一周只花一天时间在土地上。
农民40岁了。发现自己没有花时间找对象，所以没有后代。20年农业技术清零。下一个农民会从零开始做无意义的劳动。
""",
"""
第2个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代”。
于是农民勤勤恳恳，每日劳作，每日学习，并时不时把农业知识传递给村里其他的人。终于在20年后达到了一个比较自由的状态。种什么，什么大丰收。可以一周只花一天时间在土地上。
农民40岁了。发现自己虽然没有对象，但好像村里所有人都比较佩服他。20年农业技术得到传递。下一个农民一开始就是一个比较自由的状态。农业变成了一门有利可图、十分轻松的职业。
""",
"""
第3个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代”。
于是农民勤勤恳恳，每日劳作，每日学习，并时不时把农业知识传递给村里其他的人。但好景不长，因为所有人都知道土地种植可以实现自给自足，所以所有人都精通种地。
然后，一些比较贪婪的人发现，只要自己能拥有更多的土地，就能有更多的丰收。好像丰收量与土地面积是成正比的。而粮食储物，是一个人财产的证明。越富有，越是有很多的妹子愿意归于他的门下，成为他的妻子。只要服侍得好，就可以吃喝不愁。
这种巨大的诱惑，使得一部分农民放下了锄头，拿起了刀枪，不管是用骗局，还是用明抢的，最终目的就是把别人的土地抢到手。
于是第3个农民，没有办法，他只会种地。所以土地被别人抢走了。
由于没有粮食来源，这第3个农民，很快就饿死了。农业技术没办法得到积累。
""",
"""
第4个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代。同时要加强自身的军事实力，免得土地被人抢走”。
于是农民勤勤恳恳，每日劳作，每日学习，并时不时把农业知识传递给村里其他的人，同时练习武术。在20年后，他成为了一名武术大师，同时他也精通农业种植，可以每周花1天时间在农业上，另一天时间在身体训练上。
有一次，有个贪婪的劫匪，想要抢走他的土地。他冷笑一声，说了一句“总算等到你了，我苦练20年武功，就是为了打击你这种坏人！”。于是第4个农民飞起一脚，把劫匪踢死了。成功守护土地。
农业技术得到积累，农民安度晚年。
""",
# 很明显，我们可以看出，农民的生活如果继续这么下去，会很累。每天都在学习新的知识、练习新的技能，就为了正常生活。正常生活有那么难吗？看起来，他的困难，在后期，都不来自大自然，而是其他人，社会上的其他人。如果这个农民在第9999级当了皇帝，没准一生气，会下令提前杀光社会上80%的坏人。这很类似于“严打整顿”。
# 我作为“代码”写手，真实性裁判是我，决策发起者投手也是我，我是否清醒？
"""
第5个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代。同时要加强自身的军事实力，免得土地被人抢走”。
于是农民勤勤恳恳，每日劳作，每日学习，并时不时把农业知识传递给村里其他的人，同时练习武术。在20年后，他成为了一名武术大师，同时他也精通农业种植，可以每周花1天时间在农业上，另1天时间在身体训练上。
有一次，村里来了个陌生人，说“普天之下，莫非王土，你们的一切，都属于皇帝。你们要臣服、归顺政府。”。第5个农民听了听，觉得不可理解，自己的东西为什么要凭空送人？于是果断拒绝。
第5个农民没有想到的是，早在几十年前，就有抢匪抢走了很多的土地，并建立了一整套统治体系。要求管辖范围内所有的人都要听命于坏人头目。
所以，大军压境，几百个手持大刀的士兵闯入村子里，说是要杀了所有村民，并抢走一切。
第5个农民奋勇反抗，虽然杀死了20多个士兵，但仍然敌不过几百个士兵的连续攻击，死在了士兵的刀下。
农业技术没得到积累，小村庄被团灭，所有自由的意志被消亡!
""",
"""
第6个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代。同时要加强自身的军事实力，免得土地被人抢走。特别是要注重对其他人的军事实力的训练，团结就是力量！”。
于是农民勤勤恳恳，每日劳作，每日学习，并时不时把农业知识传递给村里其他的人，同时练习武术，同时教村民武术。在20年后，他成为了一名武术大师，同时他也精通农业种植，可以每周花1天时间在农业上，另1天时间在身体训练上，另1天花在教村民武术身上。
有一次，村里来了个陌生人，说“普天之下，莫非王土，你们的一切，都属于皇帝。你们要臣服、归顺政府。”。第6个农民听了听，觉得不可理解，自己的东西为什么要凭空送人？于是果断拒绝。
第6个农民没有想到的是，早在几十年前，就有抢匪抢走了很多的土地，并建立了一整套统治体系。要求管辖范围内所有的人都要听命于坏人头目。
所以，大军压境，几百个手持大刀的士兵闯入村子里，说是要杀了所有村民，并抢走一切。
第6个农民奋勇反抗，杀死了20多个士兵，并大喊通知其他村民，其他村民各个骁勇善战，一出手就有人倒地，很快几百个士兵都被村民全部歼灭。可谓正当防卫成功，大获全胜！成功守卫土地。
农业技术得到积累，自由的意志不倒! 经历了这个事件，所有人都对第6个农民非常佩服！所有人都选举他作为领导人，这就是最初的“民主选举制”。在第6个农民的带领下，小村子丰衣足食、不畏强权、不交税、不低头，稳定的发展起来。
""",
# A: “你研究那些没有用的东西有什么用？” B: "等它有用的时候，你再去研究它，就来不及了。"
"""
第7个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代。同时要加强自身的军事实力，免得土地被人抢走。特别是要注重对其他人的军事实力的训练，团结就是力量！”。
农民听后，觉得并不理解。觉得为什么要那么累。明明有第6个农民建立起来的民主共和国，根本就不需要干什么，就能安居乐业。为什么要自己给自己加负担？
于是每天游手好闲，反正有父母养。于是第7个农民，虽然是农民，但不会种地，靠父母和家族的救济过完一生。
农业技术没有得到积累。
""",
"""
第8个农民，他什么都不知道，yingshaoxo爸爸只是对他说：“你干什么其他事情都会失败，只有种地是你唯一的出路。但不要忘了想办法把知识传递给后代。同时要加强自身的军事实力，免得土地被人抢走。特别是要注重对其他人的军事实力的训练，团结就是力量！”。
农民听后，觉得并不理解。觉得为什么要那么累。明明有第6个农民建立起来的民主共和国，根本就不需要干什么，就能安居乐业。为什么要自己给自己加负担？
于是每天都学习一些“歪门邪道”，一些和种地、练武没有关系的东西。反正有父母养，吃喝不愁。于是第8个农民，成为了这段短暂历史上第一个发明家、第一个科学家！
据说，他能做出木车，使得家族的运输能力大大增强。他也能造出木船，使得家族能在水上行动。
不过，第8个农民，仍然不会种地，农业技术没有得到积累。
""",
"""
第9个农民，有点惨，生不逢时，生下来就处于战乱时代。
具体事件是: 坏人强盗皇帝系统，发现了新生的民主共和国。觉得是个威胁。哪儿有农民不服从管理的道理？哪儿有不交税、不交粮到中央的道理？于是派几千人的军队入侵村庄。
这些士兵也不是真的个个意志刚强，只是刚好被抓去当了士兵，经过每天“不听命令就要挨打”的训练之后，这些士兵既身体强壮，又心灵脆弱，领导层一句话，就算是跳楼自杀，他们也会执行，因为怕受“军罚”，怕挨打。
虽然村庄里的自由战士个个善战，但在这场人数不对等的战争中，也损失很大。但由于村庄每个人都是功夫大师，所以这场战争变成了长久的攻防战。皇帝系统时不时会派军队来捣乱、搞破坏。
同时，只要战争，战场上就有掉装备的可能性。很明显，皇帝系统的人，发现了木车、木船的使用痕迹，于是一路跟踪，发现了木车、木船的存在。很快造猫画虎，仿造复制了一批木车，用于提高皇帝系统的生产力。
第9个农民面临的选择有点多，他可以继续种地练武，也可以当发明家，但看起来当发明物被敌对势力拿去用时，再强的高科技都等于零。
""",
# ...
]
